# YOLOv8 Ghost‑P2 with CBAM for 7‑class blood cell detection
nc: 7                    # number of classes
depth_multiple: 0.33     # nano depth
width_multiple: 0.25     # nano width

# YOLOv8 Ghost‑P2 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,     [64,    3, 2]]    # 0‑P1/2
  - [-1, 1, Conv,     [128,   3, 2]]    # 1‑P2/4
  - [-1, 2, C3Ghost,  [128, False]]     # 2
  - [-1, 1, CBAM,     [32]]              # CBAM(128×0.25)

  - [-1, 1, Conv,     [256,   3, 2]]    # 4‑P3/8
  - [-1, 4, C3Ghost,  [256, False]]     # 5
  - [-1, 1, CBAM,     [64]]              # CBAM(256×0.25)

  - [-1, 1, Conv,     [512,   3, 2]]    # 7‑P4/16
  - [-1, 6, C3Ghost,  [512, False]]     # 8
  - [-1, 1, CBAM,     [128]]             # CBAM(512×0.25)

  - [-1, 1, Conv,     [1024,  3, 2]]    # 10‑P5/32
  - [-1, 3, C3Ghost,  [1024, False]]    # 11
  - [-1, 1, CBAM,     [256]]             # CBAM(1024×0.25)

  - [-1, 1, SPPF,     [1024,  5]]       # 12

neck:
  # Feature Pyramid with P2
  - [-1, 1, Upsample, [None, 2, 'nearest']]      # 13
  - [[-1, 9], 1, Concat,   [1]]                  # 14 (P4/16)
  - [-1, 3, C3Ghost,  [512, False]]              # 15
  - [-1, 1, CBAM,     [128]]                     # CBAM(512×0.25)

  - [-1, 1, Upsample, [None, 2, 'nearest']]      # 17
  - [[-1, 6], 1, Concat,   [1]]                  # 18 (P3/8)
  - [-1, 3, C3Ghost,  [256, False]]              # 19
  - [-1, 1, CBAM,     [64]]                      # CBAM(256×0.25)

  - [-1, 1, Upsample, [None, 2, 'nearest']]      # 21
  - [[-1, 3], 1, Concat,   [1]]                  # 22 (P2/4)
  - [-1, 3, C3Ghost,  [128, False]]              # 23

  # PAN down‑sampling path
  - [-1, 1, Conv,     [128,   3, 2]]             # 24
  - [[-1, 20], 1, Concat, [1]]                   # 25 (back to P3/8)
  - [-1, 3, C3Ghost,  [256, False]]              # 26

  - [-1, 1, Conv,     [256,   3, 2]]             # 27
  - [[-1, 16], 1, Concat, [1]]                   # 28 (back to P4/16)
  - [-1, 3, C3Ghost,  [512, False]]              # 29

  - [-1, 1, Conv,     [512,   3, 2]]             # 30
  - [[-1, 12], 1, Concat, [1]]                   # 31 (back to P5/32)
  - [-1, 3, C3Ghost,  [1024, False]]             # 32

head:
  # Detect on P2/4, P3/8, P4/16, P5/32
  - [[23, 26, 29, 32], 1, Detect, [nc]]
