# ulralytics/cfg/models/v8/yolov8-ghost-p2-cbam.yaml
# Copied from yolov8-ghost-p2.yaml with CBAM in backbone only

nc: 7
depth_multiple: 0.33
width_multiple: 0.25

#--- Backbone with CBAM injected ---#
backbone:
  - [-1, 1, Conv,    [64,   3, 2]]
  - [-1, 1, Conv,    [128,  3, 2]]
  - [-1, 2, C3Ghost, [128, False]]
  - [-1, 1, CBAM,    [32]]         # 128×0.25

  - [-1, 1, Conv,    [256,  3, 2]]
  - [-1, 4, C3Ghost, [256, False]]
  - [-1, 1, CBAM,    [64]]         # 256×0.25

  - [-1, 1, Conv,    [512,  3, 2]]
  - [-1, 6, C3Ghost, [512, False]]
  - [-1, 1, CBAM,    [128]]        # 512×0.25

  - [-1, 1, Conv,    [1024, 3, 2]]
  - [-1, 3, C3Ghost, [1024,False]]
  - [-1, 1, CBAM,    [256]]        # 1024×0.25

  - [-1, 1, SPPF,    [1024, 5]]

#--- Neck & Head left intact from orig yolov8-ghost-p2.yaml ---#
neck:
  - [-1, 1, Upsample, [None, 2, 'nearest']]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C3Ghost, [512, False]]

  - [-1, 1, Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C3Ghost, [256, False]]

  - [-1, 1, Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 3, C3Ghost, [128, False]]

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 20], 1, Concat, [1]]
  - [-1, 3, C3Ghost, [256, False]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 3, C3Ghost, [512, False]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C3Ghost, [1024,False]]

head:
  - [[23, 26, 29, 32], 1, Detect, [nc]]
