# Parameters
nc: 87
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0 backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, C2f, [128, True]]       # 2
  - [-1, 1, CBAM, [128]]            # 🔥 CBAM after 128
  - [-1, 1, Conv, [256, 3, 2]]      # 4-P3/8
  - [-1, 6, C2f, [256, True]]       # 5
  - [-1, 1, CBAM, [256]]            # 🔥 CBAM after 256
  - [-1, 1, Conv, [512, 3, 2]]      # 7-P4/16
  - [-1, 6, C2f, [512, True]]       # 8
  - [-1, 1, CBAM, [512]]            # 🔥 CBAM after 512
  - [-1, 1, Conv, [1024, 3, 2]]     # 10-P5/32
  - [-1, 3, C2f, [1024, True]]      # 11
  - [-1, 1, CBAM, [1024]]           # 🔥 CBAM after 1024
  - [-1, 1, SPPF, [1024, 5]]        # 13

# YOLOv8.0-p2 head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, C2f, [128]]

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]

  - [[18, 21, 24, 27], 1, Detect, [nc]]
