# ultralytics/cfg/models/11/yolov11swin_fuse.yaml
nc: 7

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # Swin‑Tiny returns three feature maps → nodes 0,1,2
  - [-1, 1, SwinTinyBackbone, []]
  # Fuse them into a single tensor via concatenation along channels
  - [[0, 1, 2], 1, Concat, [1]]
  # Reduce channels to 512 for the Detect head
  - [-1, 1, Conv, [512, 1, 1]]

head:
  # Run Detect on that single fused feature map
  - [[3], 1, Detect, [nc, [512]]]

detection_config:
  anchors:
    - [8, 10, 13, 16, 25, 33]
    - [23, 30, 39, 52, 61, 45]
    - [59, 119, 116, 90, 156, 198]
  loss_weights:
    box: 7.5
    cls: 0.75
    dfl: 1.5
  nms:
    iou_threshold: 0.6
    conf_threshold: 0.20
    max_detections: 1500
