# Metadata
author: Y-T-G
task: detect
keywords: [cnn, yolo11, small-object]
description: YOLO11 object detection model with an extra P2 scale for small object detection enhanced with CBAM attention modules.
flops:
  n: 11.4
  s: 29.7
  m: 88.9
  l: 113.6
  x: 245.1
parameters:
  n: 2740032
  s: 9625968
  m: 20591120
  l: 26116368
  x: 57849456
min_version: 8.3.0
discussion: https://github.com/Y-T-G/community/discussions/60

# Model Scale Overrides
# Using small-model (s) depth/width multipliers
depth_multiple: 0.33
width_multiple: 0.50

# Model Configuration
nc: 80
strides: [4, 8, 16, 32]
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # Stem
  - [-1, 1, Conv, [64, 3, 2]]  # 0:P1/2

  # P2 Backbone
  - [-1, 1, Conv, [128, 3, 2]]  # 1:P2/4
  - [-1, 1, CBAM, [128]]        # 2:CBAM after P2
  - [-1, 2, C3k2, [256, False, 0.25]]  # 3

  # P3 Backbone
  - [-1, 1, Conv, [256, 3, 2]]  # 4:P3/8
  - [-1, 1, CBAM, [256]]        # 5:CBAM after P3
  - [-1, 2, C3k2, [512, False, 0.25]]  # 6

  # P4 Backbone
  - [-1, 1, Conv, [512, 3, 2]]  # 7:P4/16
  - [-1, 1, CBAM, [512]]        # 8:CBAM after P4
  - [-1, 2, C3k2, [512, True]]  # 9

  # P5 Backbone
  - [-1, 1, Conv, [1024, 3, 2]] # 10:P5/32
  - [-1, 1, CBAM, [1024]]       # 11:CBAM after P5
  - [-1, 2, C3k2, [1024, True]] # 12
  - [-1, 1, SPPF, [1024, 5]]    # 13
  - [-1, 2, C2PSA, [1024]]      # 14

head:
  # Top-Down Path (Feature Pyramid)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 15
  - [[-1, 9], 1, Concat, [1]]                   # 16 fuse P4
  - [-1, 2, C3k2, [512, False]]                 # 17
  - [-1, 1, CBAM, [512]]                        # 18:CBAM P4 head

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 19
  - [[-1, 6], 1, Concat, [1]]                   # 20 fuse P3
  - [-1, 2, C3k2, [256, False]]                 # 21
  - [-1, 1, CBAM, [256]]                        # 22:CBAM P3 head

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 23
  - [[-1, 3], 1, Concat, [1]]                   # 24 fuse P2
  - [-1, 2, C3k2, [128, False]]                 # 25
  - [-1, 1, CBAM, [128]]                        # 26:CBAM P2 head

  # Bottom-Up Path (PAN)
  - [-1, 1, Conv, [128, 3, 2]]                  # 27
  - [[-1, 21], 1, Concat, [1]]                  # 28
  - [-1, 2, C3k2, [256, False]]                 # 29
  - [-1, 1, CBAM, [256]]                        # 30

  - [-1, 1, Conv, [256, 3, 2]]                  # 31
  - [[-1, 17], 1, Concat, [1]]                  # 32
  - [-1, 2, C3k2, [512, False]]                 # 33
  - [-1, 1, CBAM, [512]]                        # 34

  - [-1, 1, Conv, [512, 3, 2]]                  # 35
  - [[-1, 14], 1, Concat, [1]]                  # 36
  - [-1, 2, C3k2, [1024, True]]                 # 37
  - [-1, 1, CBAM, [1024]]                       # 38

  # Detection Head
  - [[26, 29, 33, 37], 1, Detect, {
      nc: 80,
      anchors: [[12,16,19,36,40,28],
                [36,75,76,55,72,146],
                [142,110,192,243,459,401],
                [459,401,666,611,814,737]],
      iou_t: 0.20,
      dynamic: true,
      dfl: true,
      max_det: 300
    }]
