# YOLOv11 Blood Cell Detection Architecture
# Optimized for RBC, WBC, and Platelet detection

# Parameters
nc: 7 # number of classes: RBC, WBC, Platelets
scales:  # model compound scaling constants
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 0.75, 1024]
  l: [0.50, 1.00, 1024]
  x: [0.50, 1.25, 1024]

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]           # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1 - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2 - P3/8
  - [-1, 1, Conv, [256, 3, 2]]          # 3 - P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4 - P4/16
  - [-1, 1, Conv, [512, 3, 2]]          # 5 - P4/16
  - [-1, 2, C3k2, [512, True]]          # 6 - P5/32
  - [-1, 1, Conv, [1024, 3, 2]]         # 7 - P5/32
  - [-1, 2, C3k2, [1024, True]]         # 8 - P5/32
  - [-1, 1, SPPF, [1024, 5]]            # 9 - SPPF

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10
  - [[-1, 6], 1, Concat, [1]]                   # 11
  - [-1, 2, C3k2, [512, False]]                 # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 4], 1, Concat, [1]]                   # 14
  - [-1, 2, C3k2, [256, False]]                 # 15 (P3 - small)

  - [-1, 1, Conv, [256, 3, 2]]                  # 16
  - [[-1, 12], 1, Concat, [1]]                  # 17
  - [-1, 2, C3k2, [512, False]]                 # 18 (P4 - medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 19
  - [[-1, 9], 1, Concat, [1]]                   # 20
  - [-1, 2, C3k2, [1024, False]]                # 21 (P5 - large)

  - [[15, 18, 21], 1, Detect, [nc]]             # 22

