# ultralytics/cfg/models/11/yolov11_swinT_fpn.yaml
# Swin‑Tiny backbone + YOLOv11 FPN neck for 7‑class blood cell detection

nc: 7          # Basophil, Neutrophil, Lymphocyte, Monocyte, Platelets, Eosinophil, RBC
strides: [8, 16, 32]

# model compound scaling constants (parser needs these, Swin ignores them)
scales:
  default: [1.00, 1.00, 1024]

backbone:
  # 1) Load Swin‑Tiny via TorchVision wrapper (features_only)
  - [-1, 1, TorchVision, [768, swin_t, DEFAULT, True, 5, True]]
  # 2) Extract P3 features: index 192 channels @ out_indices[1]
  - [0, 1, Index, [192, 4]]
  - [-1, 1, torchvision.ops.Permute, [[0,3,1,2]]]
  # 3) Extract P4 features: index 384 channels @ out_indices[2]
  - [0, 1, Index, [384, 6]]
  - [-1, 1, torchvision.ops.Permute, [[0,3,1,2]]]
  # 4) Extract P5 features: index 768 channels @ out_indices[3]
  - [0, 1, Index, [768, 8]]
  - [-1, 1, torchvision.ops.Permute, [[0,3,1,2]]]
  # 5) Optional SPPF on P5
  - [-1, 1, SPPF, [768, 5]]

head:
  # Top‑down pathway
  - [-1, 1, nn.Upsample, [None, 2, nearest]]  # up→P4
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [384, False]]
  - [-1, 1, nn.Upsample, [None, 2, nearest]]  # up→P3
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 2, C3k2, [192, False]]
  # Bottom‑up pathway
  - [-1, 1, Conv, [192, 3, 2]]  
  - [[-1, -5], 1, Concat, [1]]
  - [-1, 2, C3k2, [384, False]]
  - [-1, 1, Conv, [384, 3, 2]]
  - [[-1, -11], 1, Concat, [1]]
  - [-1, 2, C3k2, [768, True]]
  # Detect on P3, P4, P5
  - [[13, 15, 18], 1, Detect, [nc]]

# anchors tuned for platelets (small), RBCs/eos, WBCs (large)
detection_config:
  anchors:
    - [8, 10, 13, 16, 25, 33]       # P3/8 – platelets
    - [23, 30, 39, 52, 61, 45]      # P4/16 – RBCs & eosinophils
    - [59, 119, 116, 90, 156, 198]  # P5/32 – larger WBCs
  loss_weights:
    box: 7.5
    cls: 0.75
    dfl: 1.5
  nms:
    iou_threshold: 0.6
    conf_threshold: 0.20
    max_detections: 1500

