# YOLOv11 7-Class Blood Cell Detection Architecture
# Classes: Basophil, Neutrophil, Lymphocyte, Monocyte, Platelets, Eosinophil, RBC

nc: 7  # number of classes

scales:  # model compound scaling constants
  n: [0.50, 0.25, 1024]  # YOLOv11n
  s: [0.50, 0.50, 1024]
  m: [0.50, 0.75, 1024]
  l: [0.50, 1.00, 1024]
  x: [0.50, 1.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2-P3/8
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4-P4/16
  - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16
  - [-1, 2, C3k2, [512, True]]         # 6-P5/32
  - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]        # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]]           # 9-SPPF

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 10
  - [[-1, 6], 1, Concat, [1]]                    # 11
  - [-1, 2, C3k2, [512, False]]                  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 13
  - [[-1, 4], 1, Concat, [1]]                    # 14
  - [-1, 2, C3k2, [256, False]]                  # 15

  - [-1, 1, Conv, [256, 3, 2]]                   # 16
  - [[-1, 12], 1, Concat, [1]]                   # 17
  - [-1, 2, C3k2, [512, False]]                  # 18

  - [-1, 1, Conv, [512, 3, 2]]                   # 19
  - [[-1, 9], 1, Concat, [1]]                    # 20
  - [-1, 2, C3k2, [1024, False]]                 # 21

  - [[15, 18, 21], 1, Detect, [nc]]              # 22

detection_config:
  anchors:
    - [8, 10, 13, 16, 25, 33]       # P3/8 - platelets
    - [23, 30, 39, 52, 61, 45]      # P4/16 - RBCs, eosinophils
    - [59, 119, 116, 90, 156, 198]  # P5/32 - WBCs

  loss_weights:
    box: 7.5
    cls: 0.75
    dfl: 1.5

  nms:
    iou_threshold: 0.6
    conf_threshold: 0.20
    max_detections: 1500

training:
  lr0: 0.01
  lrf: 0.01
  momentum: 0.937
  weight_decay: 0.0005
  warmup_epochs: 3.0
  warmup_momentum: 0.8
  warmup_bias_lr: 0.1
  box: 7.5
  cls: 0.75
  dfl: 1.5
  label_smoothing: 0.0
  nbs: 64

  hsv_h: 0.010
  hsv_s: 0.5
  hsv_v: 0.3
  degrees: 0.0
  translate: 0.05
  scale: 0.3
  shear: 0.0
  perspective: 0.0
  flipud: 0.0
  fliplr: 0.3
  mosaic: 0.8
  mixup: 0.0
  copy_paste: 0.0
